MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA106/mcu.h
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR12BITS {
  union {
    struct {
      uint16_t RP24R:6;
      uint16_t :2;
      uint16_t RP25R:6;
    };
    struct {
      uint16_t RP24R0:1;
      uint16_t RP24R1:1;
      uint16_t RP24R2:1;
      uint16_t RP24R3:1;
      uint16_t RP24R4:1;
      uint16_t RP24R5:1;
      uint16_t :2;
      uint16_t RP25R0:1;
      uint16_t RP25R1:1;
      uint16_t RP25R2:1;
      uint16_t RP25R3:1;
      uint16_t RP25R4:1;
      uint16_t RP25R5:1;
    };
  };
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      uint16_t RP26R:6;
      uint16_t :2;
      uint16_t RP27R:6;
    };
    struct {
      uint16_t RP26R0:1;
      uint16_t RP26R1:1;
      uint16_t RP26R2:1;
      uint16_t RP26R3:1;
      uint16_t RP26R4:1;
      uint16_t RP26R5:1;
      uint16_t :2;
      uint16_t RP27R0:1;
      uint16_t RP27R1:1;
      uint16_t RP27R2:1;
      uint16_t RP27R3:1;
      uint16_t RP27R4:1;
      uint16_t RP27R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      uint16_t RP28R:6;
      uint16_t :2;
      uint16_t RP29R:6;
    };
    struct {
      uint16_t RP28R0:1;
      uint16_t RP28R1:1;
      uint16_t RP28R2:1;
      uint16_t RP28R3:1;
      uint16_t RP28R4:1;
      uint16_t RP28R5:1;
      uint16_t :2;
      uint16_t RP29R0:1;
      uint16_t RP29R1:1;
      uint16_t RP29R2:1;
      uint16_t RP29R3:1;
      uint16_t RP29R4:1;
      uint16_t RP29R5:1;
    };
  };
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define G1CMDL G1CMDL
extern volatile uint16_t G1CMDL __attribute__((__sfr__));
typedef struct tagG1CMDLBITS {
  uint16_t GCMD0:1;
  uint16_t GCMD1:1;
  uint16_t GCMD2:1;
  uint16_t GCMD3:1;
  uint16_t GCMD4:1;
  uint16_t GCMD5:1;
  uint16_t GCMD6:1;
  uint16_t GCMD7:1;
  uint16_t GCMD8:1;
  uint16_t GCMD9:1;
  uint16_t GCMD10:1;
  uint16_t GCMD11:1;
  uint16_t GCMD12:1;
  uint16_t GCMD13:1;
  uint16_t GCMD14:1;
  uint16_t GCMD15:1;
} G1CMDLBITS;
extern volatile G1CMDLBITS G1CMDLbits __attribute__((__sfr__));

#define G1CMDH G1CMDH
extern volatile uint16_t G1CMDH __attribute__((__sfr__));
typedef struct tagG1CMDHBITS {
  uint16_t GCMD16:1;
  uint16_t GCMD17:1;
  uint16_t GCMD18:1;
  uint16_t GCMD19:1;
  uint16_t GCMD20:1;
  uint16_t GCMD21:1;
  uint16_t GCMD22:1;
  uint16_t GCMD23:1;
  uint16_t GCMD24:1;
  uint16_t GCMD25:1;
  uint16_t GCMD26:1;
  uint16_t GCMD27:1;
  uint16_t GCMD28:1;
  uint16_t GCMD29:1;
  uint16_t GCMD30:1;
  uint16_t GCMD31:1;
} G1CMDHBITS;
extern volatile G1CMDHBITS G1CMDHbits __attribute__((__sfr__));

#define G1CON1 G1CON1
extern volatile uint16_t G1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON1BITS {
  union {
    struct {
      uint16_t GCMDCNT:5;
      uint16_t PUBPP:3;
      uint16_t GCMDWMK:5;
      uint16_t G1SIDL:1;
      uint16_t :1;
      uint16_t G1EN:1;
    };
    struct {
      uint16_t GCMDCNT0:1;
      uint16_t GCMDCNT1:1;
      uint16_t GCMDCNT2:1;
      uint16_t GCMDCNT3:1;
      uint16_t GCMDCNT4:1;
      uint16_t PUBPP0:1;
      uint16_t PUBPP1:1;
      uint16_t PUBPP2:1;
      uint16_t GCMDWMK0:1;
      uint16_t GCMDWMK1:1;
      uint16_t GCMDWMK2:1;
      uint16_t GCMDWMK3:1;
      uint16_t GCMDWMK4:1;
    };
  };
} G1CON1BITS;
extern volatile G1CON1BITS G1CON1bits __attribute__((__sfr__));

#define G1STAT G1STAT
extern volatile uint16_t G1STAT __attribute__((__sfr__));
typedef struct tagG1STATBITS {
  uint16_t CMDMPT:1;
  uint16_t CMDFUL:1;
  uint16_t CMDLV:1;
  uint16_t HMRGN:1;
  uint16_t VMRGN:1;
  uint16_t CHRBUSY:1;
  uint16_t RCCBUSY:1;
  uint16_t IPUBUSY:1;
  uint16_t :7;
  uint16_t PUBUSY:1;
} G1STATBITS;
extern volatile G1STATBITS G1STATbits __attribute__((__sfr__));

#define G1IE G1IE
extern volatile uint16_t G1IE __attribute__((__sfr__));
typedef struct tagG1IEBITS {
  uint16_t CMDMPTIE:1;
  uint16_t CMDFULIE:1;
  uint16_t CMDLVIE:1;
  uint16_t HMRGNIE:1;
  uint16_t VMRGNIE:1;
  uint16_t CHRIE:1;
  uint16_t RCCIE:1;
  uint16_t IPUIE:1;
  uint16_t :7;
  uint16_t PUIE:1;
} G1IEBITS;
extern volatile G1IEBITS G1IEbits __attribute__((__sfr__));

#define G1IR G1IR
extern volatile uint16_t G1IR __attribute__((__sfr__));
typedef struct tagG1IRBITS {
  uint16_t CMDMPTIF:1;
  uint16_t CMDFULIF:1;
  uint16_t CMDLVIF:1;
  uint16_t HMRGNIF:1;
  uint16_t VMRGNIF:1;
  uint16_t CHRIF:1;
  uint16_t RCCIF:1;
  uint16_t IPUIF:1;
  uint16_t :7;
  uint16_t PUIF:1;
} G1IRBITS;
extern volatile G1IRBITS G1IRbits __attribute__((__sfr__));

#define G1W1ADRL G1W1ADRL
extern volatile uint16_t G1W1ADRL __attribute__((__sfr__));
typedef struct tagG1W1ADRLBITS {
  uint16_t W1ADR0:1;
  uint16_t W1ADR1:1;
  uint16_t W1ADR2:1;
  uint16_t W1ADR3:1;
  uint16_t W1ADR4:1;
  uint16_t W1ADR5:1;
  uint16_t W1ADR6:1;
  uint16_t W1ADR7:1;
  uint16_t W1ADR8:1;
  uint16_t W1ADR9:1;
  uint16_t W1ADR10:1;
  uint16_t W1ADR11:1;
  uint16_t W1ADR12:1;
  uint16_t W1ADR13:1;
  uint16_t W1ADR14:1;
  uint16_t W1ADR15:1;
} G1W1ADRLBITS;
extern volatile G1W1ADRLBITS G1W1ADRLbits __attribute__((__sfr__));

#define G1W1ADRH G1W1ADRH
extern volatile uint16_t G1W1ADRH __attribute__((__sfr__));
typedef struct tagG1W1ADRHBITS {
  uint16_t W1ADR16:1;
  uint16_t W1ADR17:1;
  uint16_t W1ADR18:1;
  uint16_t W1ADR19:1;
  uint16_t W1ADR20:1;
  uint16_t W1ADR21:1;
  uint16_t W1ADR22:1;
  uint16_t W1ADR23:1;
} G1W1ADRHBITS;
extern volatile G1W1ADRHBITS G1W1ADRHbits __attribute__((__sfr__));

#define G1W2ADRL G1W2ADRL
extern volatile uint16_t G1W2ADRL __attribute__((__sfr__));
typedef struct tagG1W2ADRLBITS {
  uint16_t W2ADR0:1;
  uint16_t W2ADR1:1;
  uint16_t W2ADR2:1;
  uint16_t W2ADR3:1;
  uint16_t W2ADR4:1;
  uint16_t W2ADR5:1;
  uint16_t W2ADR6:1;
  uint16_t W2ADR7:1;
  uint16_t W2ADR8:1;
  uint16_t W2ADR9:1;
  uint16_t W2ADR10:1;
  uint16_t W2ADR11:1;
  uint16_t W2ADR12:1;
  uint16_t W2ADR13:1;
  uint16_t W2ADR14:1;
  uint16_t W2ADR15:1;
} G1W2ADRLBITS;
