MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA106/mcu.h
#define _RPOR12_RP24R0_POSITION                  0x00000000
#define _RPOR12_RP24R0_MASK                      0x00000001
#define _RPOR12_RP24R0_LENGTH                    0x00000001

#define _RPOR12_RP24R1_POSITION                  0x00000001
#define _RPOR12_RP24R1_MASK                      0x00000002
#define _RPOR12_RP24R1_LENGTH                    0x00000001

#define _RPOR12_RP24R2_POSITION                  0x00000002
#define _RPOR12_RP24R2_MASK                      0x00000004
#define _RPOR12_RP24R2_LENGTH                    0x00000001

#define _RPOR12_RP24R3_POSITION                  0x00000003
#define _RPOR12_RP24R3_MASK                      0x00000008
#define _RPOR12_RP24R3_LENGTH                    0x00000001

#define _RPOR12_RP24R4_POSITION                  0x00000004
#define _RPOR12_RP24R4_MASK                      0x00000010
#define _RPOR12_RP24R4_LENGTH                    0x00000001

#define _RPOR12_RP24R5_POSITION                  0x00000005
#define _RPOR12_RP24R5_MASK                      0x00000020
#define _RPOR12_RP24R5_LENGTH                    0x00000001

#define _RPOR12_RP25R0_POSITION                  0x00000008
#define _RPOR12_RP25R0_MASK                      0x00000100
#define _RPOR12_RP25R0_LENGTH                    0x00000001

#define _RPOR12_RP25R1_POSITION                  0x00000009
#define _RPOR12_RP25R1_MASK                      0x00000200
#define _RPOR12_RP25R1_LENGTH                    0x00000001

#define _RPOR12_RP25R2_POSITION                  0x0000000A
#define _RPOR12_RP25R2_MASK                      0x00000400
#define _RPOR12_RP25R2_LENGTH                    0x00000001

#define _RPOR12_RP25R3_POSITION                  0x0000000B
#define _RPOR12_RP25R3_MASK                      0x00000800
#define _RPOR12_RP25R3_LENGTH                    0x00000001

#define _RPOR12_RP25R4_POSITION                  0x0000000C
#define _RPOR12_RP25R4_MASK                      0x00001000
#define _RPOR12_RP25R4_LENGTH                    0x00000001

#define _RPOR12_RP25R5_POSITION                  0x0000000D
#define _RPOR12_RP25R5_MASK                      0x00002000
#define _RPOR12_RP25R5_LENGTH                    0x00000001

#define _RPOR13_RP26R_POSITION                   0x00000000
#define _RPOR13_RP26R_MASK                       0x0000003F
#define _RPOR13_RP26R_LENGTH                     0x00000006

#define _RPOR13_RP27R_POSITION                   0x00000008
#define _RPOR13_RP27R_MASK                       0x00003F00
#define _RPOR13_RP27R_LENGTH                     0x00000006

#define _RPOR13_RP26R0_POSITION                  0x00000000
#define _RPOR13_RP26R0_MASK                      0x00000001
#define _RPOR13_RP26R0_LENGTH                    0x00000001

#define _RPOR13_RP26R1_POSITION                  0x00000001
#define _RPOR13_RP26R1_MASK                      0x00000002
#define _RPOR13_RP26R1_LENGTH                    0x00000001

#define _RPOR13_RP26R2_POSITION                  0x00000002
#define _RPOR13_RP26R2_MASK                      0x00000004
#define _RPOR13_RP26R2_LENGTH                    0x00000001

#define _RPOR13_RP26R3_POSITION                  0x00000003
#define _RPOR13_RP26R3_MASK                      0x00000008
#define _RPOR13_RP26R3_LENGTH                    0x00000001

#define _RPOR13_RP26R4_POSITION                  0x00000004
#define _RPOR13_RP26R4_MASK                      0x00000010
#define _RPOR13_RP26R4_LENGTH                    0x00000001

#define _RPOR13_RP26R5_POSITION                  0x00000005
#define _RPOR13_RP26R5_MASK                      0x00000020
#define _RPOR13_RP26R5_LENGTH                    0x00000001

#define _RPOR13_RP27R0_POSITION                  0x00000008
#define _RPOR13_RP27R0_MASK                      0x00000100
#define _RPOR13_RP27R0_LENGTH                    0x00000001

#define _RPOR13_RP27R1_POSITION                  0x00000009
#define _RPOR13_RP27R1_MASK                      0x00000200
#define _RPOR13_RP27R1_LENGTH                    0x00000001

#define _RPOR13_RP27R2_POSITION                  0x0000000A
#define _RPOR13_RP27R2_MASK                      0x00000400
#define _RPOR13_RP27R2_LENGTH                    0x00000001

#define _RPOR13_RP27R3_POSITION                  0x0000000B
#define _RPOR13_RP27R3_MASK                      0x00000800
#define _RPOR13_RP27R3_LENGTH                    0x00000001

#define _RPOR13_RP27R4_POSITION                  0x0000000C
#define _RPOR13_RP27R4_MASK                      0x00001000
#define _RPOR13_RP27R4_LENGTH                    0x00000001

#define _RPOR13_RP27R5_POSITION                  0x0000000D
#define _RPOR13_RP27R5_MASK                      0x00002000
#define _RPOR13_RP27R5_LENGTH                    0x00000001

#define _RPOR14_RP28R_POSITION                   0x00000000
#define _RPOR14_RP28R_MASK                       0x0000003F
#define _RPOR14_RP28R_LENGTH                     0x00000006

#define _RPOR14_RP29R_POSITION                   0x00000008
#define _RPOR14_RP29R_MASK                       0x00003F00
#define _RPOR14_RP29R_LENGTH                     0x00000006

#define _RPOR14_RP28R0_POSITION                  0x00000000
#define _RPOR14_RP28R0_MASK                      0x00000001
#define _RPOR14_RP28R0_LENGTH                    0x00000001

#define _RPOR14_RP28R1_POSITION                  0x00000001
#define _RPOR14_RP28R1_MASK                      0x00000002
#define _RPOR14_RP28R1_LENGTH                    0x00000001

#define _RPOR14_RP28R2_POSITION                  0x00000002
#define _RPOR14_RP28R2_MASK                      0x00000004
#define _RPOR14_RP28R2_LENGTH                    0x00000001

#define _RPOR14_RP28R3_POSITION                  0x00000003
#define _RPOR14_RP28R3_MASK                      0x00000008
#define _RPOR14_RP28R3_LENGTH                    0x00000001

#define _RPOR14_RP28R4_POSITION                  0x00000004
#define _RPOR14_RP28R4_MASK                      0x00000010
#define _RPOR14_RP28R4_LENGTH                    0x00000001

#define _RPOR14_RP28R5_POSITION                  0x00000005
#define _RPOR14_RP28R5_MASK                      0x00000020
#define _RPOR14_RP28R5_LENGTH                    0x00000001

#define _RPOR14_RP29R0_POSITION                  0x00000008
#define _RPOR14_RP29R0_MASK                      0x00000100
#define _RPOR14_RP29R0_LENGTH                    0x00000001

#define _RPOR14_RP29R1_POSITION                  0x00000009
#define _RPOR14_RP29R1_MASK                      0x00000200
#define _RPOR14_RP29R1_LENGTH                    0x00000001

#define _RPOR14_RP29R2_POSITION                  0x0000000A
#define _RPOR14_RP29R2_MASK                      0x00000400
#define _RPOR14_RP29R2_LENGTH                    0x00000001

#define _RPOR14_RP29R3_POSITION                  0x0000000B
#define _RPOR14_RP29R3_MASK                      0x00000800
#define _RPOR14_RP29R3_LENGTH                    0x00000001

