MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA106/mcu.h
#define _G1DPHT_DPHT6_POSITION                   0x00000006
#define _G1DPHT_DPHT6_MASK                       0x00000040
#define _G1DPHT_DPHT6_LENGTH                     0x00000001

#define _G1DPHT_DPHT7_POSITION                   0x00000007
#define _G1DPHT_DPHT7_MASK                       0x00000080
#define _G1DPHT_DPHT7_LENGTH                     0x00000001

#define _G1DPHT_DPHT8_POSITION                   0x00000008
#define _G1DPHT_DPHT8_MASK                       0x00000100
#define _G1DPHT_DPHT8_LENGTH                     0x00000001

#define _G1DPHT_DPHT9_POSITION                   0x00000009
#define _G1DPHT_DPHT9_MASK                       0x00000200
#define _G1DPHT_DPHT9_LENGTH                     0x00000001

#define _G1DPHT_DPHT10_POSITION                  0x0000000A
#define _G1DPHT_DPHT10_MASK                      0x00000400
#define _G1DPHT_DPHT10_LENGTH                    0x00000001

#define _G1CON2_DPMODE_POSITION                  0x00000000
#define _G1CON2_DPMODE_MASK                      0x00000007
#define _G1CON2_DPMODE_LENGTH                    0x00000003

#define _G1CON2_DPBPP_POSITION                   0x00000005
#define _G1CON2_DPBPP_MASK                       0x000000E0
#define _G1CON2_DPBPP_LENGTH                     0x00000003

#define _G1CON2_DPTEST_POSITION                  0x00000008
#define _G1CON2_DPTEST_MASK                      0x00000300
#define _G1CON2_DPTEST_LENGTH                    0x00000002

#define _G1CON2_DPSTGER_POSITION                 0x0000000C
#define _G1CON2_DPSTGER_MASK                     0x00003000
#define _G1CON2_DPSTGER_LENGTH                   0x00000002

#define _G1CON2_DPGWDTH_POSITION                 0x0000000E
#define _G1CON2_DPGWDTH_MASK                     0x0000C000
#define _G1CON2_DPGWDTH_LENGTH                   0x00000002

#define _G1CON2_DPMODE0_POSITION                 0x00000000
#define _G1CON2_DPMODE0_MASK                     0x00000001
#define _G1CON2_DPMODE0_LENGTH                   0x00000001

#define _G1CON2_DPMODE1_POSITION                 0x00000001
#define _G1CON2_DPMODE1_MASK                     0x00000002
#define _G1CON2_DPMODE1_LENGTH                   0x00000001

#define _G1CON2_DPMODE2_POSITION                 0x00000002
#define _G1CON2_DPMODE2_MASK                     0x00000004
#define _G1CON2_DPMODE2_LENGTH                   0x00000001

#define _G1CON2_DPBPP0_POSITION                  0x00000005
#define _G1CON2_DPBPP0_MASK                      0x00000020
#define _G1CON2_DPBPP0_LENGTH                    0x00000001

#define _G1CON2_DPBPP1_POSITION                  0x00000006
#define _G1CON2_DPBPP1_MASK                      0x00000040
#define _G1CON2_DPBPP1_LENGTH                    0x00000001

#define _G1CON2_DPBPP2_POSITION                  0x00000007
#define _G1CON2_DPBPP2_MASK                      0x00000080
#define _G1CON2_DPBPP2_LENGTH                    0x00000001

#define _G1CON2_DPTEST0_POSITION                 0x00000008
#define _G1CON2_DPTEST0_MASK                     0x00000100
#define _G1CON2_DPTEST0_LENGTH                   0x00000001

#define _G1CON2_DPTEST1_POSITION                 0x00000009
#define _G1CON2_DPTEST1_MASK                     0x00000200
#define _G1CON2_DPTEST1_LENGTH                   0x00000001

#define _G1CON2_DPSTGER0_POSITION                0x0000000C
#define _G1CON2_DPSTGER0_MASK                    0x00001000
#define _G1CON2_DPSTGER0_LENGTH                  0x00000001

#define _G1CON2_DPSTGER1_POSITION                0x0000000D
#define _G1CON2_DPSTGER1_MASK                    0x00002000
#define _G1CON2_DPSTGER1_LENGTH                  0x00000001

#define _G1CON2_DPGWDTH0_POSITION                0x0000000E
#define _G1CON2_DPGWDTH0_MASK                    0x00004000
#define _G1CON2_DPGWDTH0_LENGTH                  0x00000001

#define _G1CON2_DPGWDTH1_POSITION                0x0000000F
#define _G1CON2_DPGWDTH1_MASK                    0x00008000
#define _G1CON2_DPGWDTH1_LENGTH                  0x00000001

#define _G1CON3_DPHSOE_POSITION                  0x00000000
#define _G1CON3_DPHSOE_MASK                      0x00000001
#define _G1CON3_DPHSOE_LENGTH                    0x00000001

#define _G1CON3_DPVSOE_POSITION                  0x00000001
#define _G1CON3_DPVSOE_MASK                      0x00000002
#define _G1CON3_DPVSOE_LENGTH                    0x00000001

#define _G1CON3_DPENOE_POSITION                  0x00000002
#define _G1CON3_DPENOE_MASK                      0x00000004
#define _G1CON3_DPENOE_LENGTH                    0x00000001

#define _G1CON3_DPPWROE_POSITION                 0x00000003
#define _G1CON3_DPPWROE_MASK                     0x00000008
#define _G1CON3_DPPWROE_LENGTH                   0x00000001

#define _G1CON3_DPHSPOL_POSITION                 0x00000004
#define _G1CON3_DPHSPOL_MASK                     0x00000010
#define _G1CON3_DPHSPOL_LENGTH                   0x00000001

#define _G1CON3_DPVSPOL_POSITION                 0x00000005
#define _G1CON3_DPVSPOL_MASK                     0x00000020
#define _G1CON3_DPVSPOL_LENGTH                   0x00000001

#define _G1CON3_DPENPOL_POSITION                 0x00000006
#define _G1CON3_DPENPOL_MASK                     0x00000040
#define _G1CON3_DPENPOL_LENGTH                   0x00000001

#define _G1CON3_DPCLKPOL_POSITION                0x00000007
#define _G1CON3_DPCLKPOL_MASK                    0x00000080
#define _G1CON3_DPCLKPOL_LENGTH                  0x00000001

#define _G1CON3_DPPOWER_POSITION                 0x00000008
#define _G1CON3_DPPOWER_MASK                     0x00000100
#define _G1CON3_DPPOWER_LENGTH                   0x00000001

#define _G1CON3_DPPINOE_POSITION                 0x00000009
#define _G1CON3_DPPINOE_MASK                     0x00000200
#define _G1CON3_DPPINOE_LENGTH                   0x00000001

#define _G1ACTDA_ACTPIX_POSITION                 0x00000000
#define _G1ACTDA_ACTPIX_MASK                     0x000000FF
#define _G1ACTDA_ACTPIX_LENGTH                   0x00000008

#define _G1ACTDA_ACTLINE_POSITION                0x00000008
#define _G1ACTDA_ACTLINE_MASK                    0x0000FF00
#define _G1ACTDA_ACTLINE_LENGTH                  0x00000008

#define _G1ACTDA_ACTPIX0_POSITION                0x00000000
#define _G1ACTDA_ACTPIX0_MASK                    0x00000001
#define _G1ACTDA_ACTPIX0_LENGTH                  0x00000001

